# AllModelModel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllModelModel Property
ParameterTypeId Class See Also
---
"Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllModelModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllModelModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllModelModel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace